app/controllers/admin/content_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = 1 LIMIT 1
---
  def edit
    @article = Article.find(params[:id])
    @current_user_is_admin=(Profile.find(current_user.profile_id).label=='admin')